In [48]:
import pandas as pd
import numpy as np
import openpyxl

In [50]:
import sys
sys.path.insert(0, r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source")

In [52]:
#data cleaning

In [54]:
df1= pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\city_target_passenger_rating.xlsx")

In [56]:
df1.head()

  city_id  target_avg_passenger_rating
0    CH01                         8.00
1    UP01                         7.25
2    AP01                         8.50
3    MP01                         8.00
4    RJ01                         8.25

In [58]:
df2 = pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\dim_city.xlsx")

In [60]:
df2.head()

  city_id city_name
0    RJ01    Jaipur
1    UP01   Lucknow
2    GJ01     Surat
3    KL01     Kochi
4    MP01    Indore

In [62]:
df3 = pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\dim_date.xlsx")

In [64]:
df3.head()

        date start_of_month month_name day_type
0 2024-01-01     2024-01-01    January  Weekday
1 2024-01-02     2024-01-01    January  Weekday
2 2024-01-03     2024-01-01    January  Weekday
3 2024-01-04     2024-01-01    January  Weekday
4 2024-01-05     2024-01-01    January  Weekday

In [66]:
df4 = pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\dim_repeat_trip_distribution.xlsx")

In [68]:
df4.head()

       month city_id  trip_count  repeat_passenger_count
0 2024-01-01    AP01          10                       7
1 2024-01-01    AP01           2                     352
2 2024-01-01    AP01           3                     158
3 2024-01-01    AP01           4                      53
4 2024-01-01    AP01           5                      38

In [70]:
df5 = pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\fact_passenger_summary.xlsx")

In [72]:
df5.head()

       month city_id  new_passengers  repeat_passengers  total_passengers
0 2024-01-01    AP01            2513                650              3163
1 2024-01-01    CH01            3920                720              4640
2 2024-01-01    GJ01            2432               1184              3616
3 2024-01-01    GJ02            2089                544              2633
4 2024-01-01    KA01            1957                172              2129

In [74]:
df6 = pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\fact_trips.xlsx")

In [75]:
df6.head()

,trip_id,date,city_id,passenger_type,distance_travelled(km),fare_amount,passenger_rating,driver_rating
0,TRPLUC240113d55de2fb,2024-01-13,UP01,repeated,11,158,5,5
1,TRPVAD240129a3b6dba8,2024-01-29,GJ02,repeated,7,74,5,5
2,TRPCOI240107a42430fb,2024-01-07,TN01,repeated,11,155,8,8
3,TRPKOC240325d7601389,2024-03-25,KL01,repeated,36,427,9,10
4,TRPVIS2406027be97166,2024-06-02,AP01,new,17,265,8,8

In [76]:
df7 = pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\monthly_target_new_passengers.xlsx")

In [77]:
df7.head()

       month city_id  target_new_passengers
0 2024-05-01    GJ01                   1500
1 2024-05-01    GJ02                   1500
2 2024-03-01    GJ01                   2000
3 2024-05-01    UP01                   2000
4 2024-05-01    MP01                   2000

In [78]:
df8 = pd.read_excel(r"C:\Users\Nikhil Mishra\OneDrive\Desktop\Data Source\monthly_target_trips.xlsx")

In [79]:
df8.head()

       month city_id  total_target_trips
0 2024-03-01    MP01                7000
1 2024-05-01    KA01                2500
2 2024-04-01    UP01               11000
3 2024-02-01    GJ02                6000
4 2024-05-01    KL01                9000

In [80]:
df= pd.DataFrame(df4)

# calculating the total trip count
total_trip_count = df['trip_count'].sum()
print(f"Total trip count: {total_trip_count}")

Total trip count: 3240

In [81]:
df = pd.DataFrame(df6)

# Display the dataframe
print("df6")
print(df)

# Calculate and display total distance travelled
total_distance = df['distance_travelled(km)'].sum()
print("\nAverage Distance Travelled:", total_distance, "km")

df6
                     trip_id       date city_id passenger_type  \
0       TRPLUC240113d55de2fb 2024-01-13    UP01       repeated
1       TRPVAD240129a3b6dba8 2024-01-29    GJ02       repeated
2       TRPCOI240107a42430fb 2024-01-07    TN01       repeated
3       TRPKOC240325d7601389 2024-03-25    KL01       repeated
4       TRPVIS2406027be97166 2024-06-02    AP01            new
...                      ...        ...     ...            ...
425898  TRPLUC2403180b02b4d0 2024-03-18    UP01       repeated
425899  TRPVAD2401032679e669 2024-01-03    GJ02       repeated
425900  TRPJAI24022578e10280 2024-02-25    RJ01       repeated
425901  TRPJAI240401e297ad20 2024-04-01    RJ01       repeated
425902  TRPJAI24021056f0e951 2024-02-10    RJ01            new

        distance_travelled(km)  fare_amount  passenger_rating  driver_rating
0                           11          158                 5              5
1                            7           74                 5              5
2                           11          155                 8              8
3                           36          427                 9             10
4                           17          265                 8              8
...                        ...          ...               ...            ...
425898                      12          134                 5              5
425899                      12          114                 7              5
425900                      26          479                 7             10
425901                      27          361                 7             10
425902                      37          666                 9             10

[425903 rows x 8 columns]

Average Distance Travelled: 8146320 km

In [82]:
df = pd.DataFrame(df1)

# calculate the  average rating

average_rating = df['target_avg_passenger_rating'].mean()

print(f"The average passenger rating is: {average_rating:.2f}")

The average passenger rating is: 7.97

In [83]:
df = pd.DataFrame(df6)

# calculate the driver average rating

average_rating = df['driver_rating'].mean()

print(f"The average driver rating is: {average_rating:.2f}")

The average driver rating is: 7.83

In [157]:
# calculate new passengers

df = pd.DataFrame(df7)

new_passengers = df['target_new_passengers'].sum()
print(f"Total New Passengers : {new_passengers}")

Total New Passengers : 185100

In [158]:
# calculate new passengers

df = pd.DataFrame(df5)

total_passengers = df['total_passengers'].sum()
print(f"Total Passengers : {total_passengers}")

Total Passengers : 238309

In [159]:
df = pd.DataFrame(df5)

total_repeat_passengers = df['repeat_passengers'].sum()
print(f"The total number of repeat passengers is: {total_repeat_passengers}")

The total number of repeat passengers is: 61311

In [160]:
# Total revenue

df = pd.DataFrame(df6)


total_revenue = df['fare_amount'].sum()
print(f"Total revenue is: {total_revenue}")

Total revenue is: 108188091

In [161]:
df = pd.DataFrame(df6)

# Find the maximum and minimum distances travelled
max_distance = df['distance_travelled(km)'].max()
min_distance = df['distance_travelled(km)'].min()

print(f"The maximum distance traveled is: {max_distance} km")
print(f"The maximum distance traveled is: {min_distance} km")

The maximum distance traveled is: 45 km
The maximum distance traveled is: 5 km

In [162]:
# Trip Type

df = pd.DataFrame(df6)

new_passenger_trips = df[df['passenger_type'] == 'new'].shape[0] 
repeated_passenger_trips = df[df['passenger_type'] == 'repeated'].shape[0]

print(f"Number of new passenger trips: {new_passenger_trips}") 
print(f"Number of repeated passenger trips: {repeated_passenger_trips}")

Number of new passenger trips: 176998
Number of repeated passenger trips: 248905

In [163]:
df = pd.DataFrame(df5)

# calculate ratio to news vs repeated passengers trips ratio

df['new_vs_repeat_ratio'] = df['new_passengers'] / df['repeat_passengers']

print(df[['city_id', 'new_vs_repeat_ratio']])

   city_id  new_vs_repeat_ratio
0     AP01             3.866154
1     CH01             5.444444
2     GJ01             2.054054
3     GJ02             3.840074
4     KA01            11.377907
5     KL01             6.119497
6     MP01             2.752178
7     RJ01             7.329817
8     TN01             4.647959
9     UP01             2.421384
10    AP01             3.012658
11    CH01             4.811254
12    GJ01             1.716679
13    GJ02             3.518033
14    KA01            11.513661
15    KL01             4.345274
16    MP01             2.609248
17    RJ01             6.495485
18    TN01             4.760116
19    UP01             2.127185
20    AP01             2.351029
21    CH01             3.701835
22    GJ01             1.302544
23    GJ02             2.322793
24    KA01             9.548077
25    KL01             3.609050
26    MP01             2.513291
27    RJ01             4.030978
28    TN01             3.601874
29    UP01             1.947596
30    AP01             1.859879
31    CH01             3.163498
32    GJ01             1.188266
33    GJ02             1.899072
34    KA01             7.779661
35    KL01             3.133883
36    MP01             1.815444
37    RJ01             3.525346
38    TN01             2.587500
39    UP01             1.544786
40    AP01             2.038906
41    CH01             2.817337
42    GJ01             1.003113
43    GJ02             1.599078
44    KA01             5.504298
45    KL01             2.357798
46    MP01             1.297505
47    RJ01             2.894680
48    TN01             2.061508
49    UP01             1.098075
50    AP01             2.369077
51    CH01             2.802768
52    GJ01             1.033557
53    GJ02             1.570413
54    KA01             5.696049
55    KL01             2.870353
56    MP01             1.786914
57    RJ01             4.889924
58    TN01             3.049751
59    UP01             1.141285

In [164]:
df = pd.DataFrame(df5)

# repeated passenger rate

df['repeated_passenger_rate'] = (df['repeat_passengers'] / df['total_passengers']) * 100

print(df[['city_id', 'repeated_passenger_rate']])

   city_id  repeated_passenger_rate
0     AP01                20.550111
1     CH01                15.517241
2     GJ01                32.743363
3     GJ02                20.660843
4     KA01                 8.078910
5     KL01                14.045936
6     MP01                26.651187
7     RJ01                12.005065
8     TN01                17.705510
9     UP01                29.227941
10    AP01                24.921136
11    CH01                17.207989
12    GJ01                36.809644
13    GJ02                22.133527
14    KA01                 7.991266
15    KL01                18.708116
16    MP01                27.706606
17    RJ01                13.341365
18    TN01                17.360763
19    UP01                31.977641
20    AP01                29.841578
21    CH01                21.268293
22    GJ01                43.430233
23    GJ02                30.095163
24    KA01                 9.480401
25    KL01                21.696443
26    MP01                28.463345
27    RJ01                19.876850
28    TN01                21.730280
29    UP01                33.925957
30    AP01                34.966514
31    CH01                24.018265
32    GJ01                45.698291
33    GJ02                34.493798
34    KA01                11.389961
35    KL01                24.190330
36    MP01                35.518376
37    RJ01                22.097760
38    TN01                27.874564
39    UP01                39.296034
40    AP01                32.906574
41    CH01                26.196269
42    GJ01                49.922288
43    GJ02                38.475177
44    KA01                15.374449
45    KL01                29.781421
46    MP01                43.525480
47    RJ01                25.676052
48    TN01                32.663642
49    UP01                47.662747
50    AP01                29.681717
51    CH01                26.296633
52    GJ01                49.174917
53    GJ02                38.904261
54    KA01                14.934181
55    KL01                25.837438
56    MP01                35.881980
57    RJ01                16.978148
58    TN01                24.692875
59    UP01                46.700919

In [165]:
df = pd.DataFrame(df6)

# calculate the average fare per kilometer
df['fare_per_km'] = df['fare_amount'] / df['distance_travelled(km)']
average_fare_per_km = df['fare_per_km'].mean()

print(f"The average fare per kilometer is: {average_fare_per_km:.2f} INR/km")

The average fare per kilometer is: 12.86 INR/km

In [167]:
df = pd.DataFrame(df6)

# Calculate the average fare per trip
average_fare_per_trip = df['fare_amount'].mean()

print(f"The average fare per trip is: {average_fare_per_trip:.2f} INR")

The average fare per trip is: 254.02 INR